[
    {
        "name": "Ramen Noodles with Boiled Egg",
        "description": "A simple and delicious ramen noodle dish with a boiled egg.",
        "idmeal": "53383",
        "category": "Japanese",
        "area": "Japan",
        "instructions": "Boil: Bring water to a boil, gently add eggs, and cook for exactly 6½ to 7 minutes.\r\nIce Bath: Immediately transfer the eggs to a bowl of ice water for 3–5 minutes to stop cooking.\r\nMarinate (Optional but recommended): Peel the eggs and marinate in a mix of 2 tbsp soy sauce, 2 tbsp mirin, 1 tsp sugar, and 4 tbsp water for at least 4 hours (or overnight).\r\nServe: Slice in half, letting the yolk flow into the broth",
        "thumbnail": "https://www.themealdb.com/images/media/meals/ip5xtp1769779958.jpg",
        "youtube": "https://www.youtube.com/watch?v=AbJNVnkndS4",
        "ingredients": [
            "2 large eggs",
            "1 packet instant ramen noodles (any flavor)",
            "1 cup water",
            "1 tsp soy sauce (optional)",
            "1 tsp mirin (optional)",
            "½ tsp sugar (optional)"
        ],
        "source": "https://www.themealdb.com/meal/53383",
        "thisweek": true,
        "favorite": true
    },
    {
        "name": "Chicken Alfredo Primavera",
        "description": "A delicious Italian chicken pasta dish with butter, cream, and vegetables.",
        "idmeal": "52796",
        "category": "Chicken",
        "area": "Italian",
        "instructions": "Heat 1 tablespoon of butter and 2 tablespoons of olive oil in a large skillet over medium-high heat. Season both sides of each chicken breast with seasoned salt and a pinch of pepper. Add the chicken to the skillet and cook for 5-7 minutes on each side, or until cooked through. While the chicken is cooking, bring a large pot of water to a boil. Season the boiling water with a few generous pinches of kosher salt. Add the pasta and give it a stir. Cook, stirring occasionally, until al dente, about 12 minutes. Reserve 1/2 cup of pasta water before draining the pasta. Remove the chicken from the pan and transfer it to a cutting board; allow it to rest. Turn the heat down to medium and dd the remaining 1 tablespoon of butter and olive oil to the same pan you used to cook the chicken. Add the veggies (minus the garlic) and red pepper flakes to the pan and stir to coat with the oil and butter (refrain from seasoning with salt until the veggies are finished browning). Cook, stirring often, until the veggies are tender, about 5 minutes. Add the garlic and a generous pinch of salt and pepper to the pan and cook for 1 minute. Deglaze the pan with the white wine. Continue to cook until the wine has reduced by half, about 3 minutes. Stir in the milk, heavy cream, and reserved pasta water. Bring the mixture to a gentle boil and allow to simmer and reduce for 2-3 minutes. Turn off the heat and add the Parmesan cheese and cooked pasta. Season with salt and pepper to taste. Garnish with Parmesan cheese and chopped parsley, if desired.",
        "thumbnail": "https://www.themealdb.com/images/media/meals/syqypv1486981727.jpg",
        "youtube": "https://www.youtube.com/watch?v=qCIbq8HywpQ",
        "ingredients": [
            "2 tablespoons Butter",
            "3 tablespoons Olive Oil",
            "5 boneless Chicken",
            "1 teaspoon Salt",
            "1 cut into 1/2-inch cubes Squash",
            "1 Head chopped Broccoli",
            "8-ounce sliced mushrooms",
            "1 red Pepper",
            "1 chopped onion",
            "3 cloves garlic",
            "1/2 teaspoon red pepper flakes",
            "1/2 cup white wine",
            "1/2 cup milk",
            "1/2 cup heavy cream",
            "1 cup grated Parmesan cheese",
            "16 ounces bowtie pasta",
            "pinch Salt",
            "pinch Pepper",
            "chopped Parsley"
        ],
        "source": "https://www.themealdb.com/meal/52796",
        "thisweek": true,
        "favorite": true
    },
    {
        "name": "Teriyaki Chicken Casserole",
        "description": "A Japanese-inspired chicken casserole with soy sauce, ginger, and garlic.",
        "idmeal": "52772",
        "category": "Chicken",
        "area": "Japanese",
        "instructions": "Preheat oven to 350° F. Spray a 9x13-inch baking pan with non-stick spray. Combine soy sauce, ½ cup water, brown sugar, ginger and garlic in a small saucepan and cover. Bring to a boil over medium heat. Remove lid and cook for one minute once boiling. Meanwhile, stir together the corn starch and 2 tablespoons of water in a separate dish until smooth. Once sauce is boiling, add mixture to the saucepan and stir to combine. Cook until the sauce starts to thicken then remove from heat. Place the chicken breasts in the prepared pan. Pour one cup of the sauce over top of chicken. Place chicken in oven and bake 35 minutes or until cooked through. Remove from oven and shred chicken in the dish using two forks. *Meanwhile, steam or cook the vegetables according to package directions. Add the cooked vegetables and rice to the casserole dish with the chicken. Add most of the remaining sauce, reserving a bit to drizzle over the top when serving. Gently toss everything together in the casserole dish until combined. Return to oven and cook 15 minutes. Remove from oven and let stand 5 minutes before serving. Drizzle each serving with remaining sauce. Enjoy!",
        "thumbnail": "https://www.themealdb.com/images/media/meals/wvpsxx1468256321.jpg",
        "youtube": "https://www.youtube.com/watch?v=4aZr5hZXP_s",
        "ingredients": [
            "3/4 cup soy sauce",
            "1/2 cup water",
            "1/4 cup brown sugar",
            "1/2 teaspoon ground ginger",
            "1/2 teaspoon minced garlic",
            "4 Tablespoons cornstarch",
            "2 chicken breasts",
            "1 (12 oz.) stir-fry vegetables",
            "3 cups brown rice"
        ],
        "source": "https://www.themealdb.com/meal/52772",
        "thisweek": true,
        "favorite": true
    },
    {
        "name": "Cajun spiced fish tacos",
        "description": "Succulent fish tacos with Cajun spice and a zesty dressing.",
        "idmeal": "52819",
        "category": "Seafood",
        "area": "Mexican",
        "instructions": "On a large plate, mix the cajun spice and cayenne pepper with a little seasoning and use to coat the fish all over. Heat a little oil in a frying pan, add in the fish and cook over a medium heat until golden. Reduce the heat and continue frying until the fish is cooked through, about 10 minutes. Soften the tortillas by heating in the microwave for 5-10 seconds. Pile high with the avocado, lettuce and spring onion, add a spoonful of salsa, top with large flakes of fish and drizzle over the dressing.",
        "thumbnail": "https://www.themealdb.com/images/media/meals/uvuyxu1503067369.jpg",
        "youtube": "https://www.youtube.com/watch?v=N4EdUt0Ou48",
        "ingredients": [
            "2 tbsp cajun",
            "1 tsp cayenne pepper",
            "4 fillets white fish",
            "1 tsp vegetable oil",
            "8 flour tortilla",
            "1 sliced avocado",
            "2 shredded little gem lettuce",
            "4 shredded Spring Onions",
            "1 x 300ml salsa",
            "1 pot sour cream",
            "1 lemon",
            "1 clove finely chopped garlic"
        ],
        "source": "https://www.themealdb.com/meal/52819",
        "thisweek": false,
        "favorite": true
    },
    {
        "name": "Kedgeree",
        "description": "A British seafood dish with smoked haddock, eggs, and spiced rice.",
        "idmeal": "52887",
        "category": "Seafood",
        "area": "British",
        "instructions": "For the rice, heat the oil in a large, lidded pan, add the onion, then gently fry for 5 mins. Add the spices and continue to fry until fragrant. Add the rice and water, then bring to the boil. Simmer for 10 mins. Poach the haddock and bay leaves in milk for 10 mins. Flake the fish. Boil the eggs for 4.5-5 mins, then peel and quarter. Gently mix the fish, eggs, herbs and rice together in the pan.",
        "thumbnail": "https://www.themealdb.com/images/media/meals/utxqpt1511639216.jpg",
        "youtube": "https://www.youtube.com/watch?v=_Pw1I1-SItE",
        "ingredients": [
            "300g Smoked Haddock",
            "2 Bay Leaves",
            "300ml Milk",
            "4 Eggs",
            "Handful Parsley",
            "Handful Coriander",
            "2 tbs Vegetable Oil",
            "1 chopped Onion",
            "1 tsp Coriander",
            "2 tsp Curry Powder",
            "300g Rice"
        ],
        "source": "https://www.themealdb.com/meal/52887",
        "thisweek": false,
        "favorite": false
    },
    {
        "name": "Escovitch Fish",
        "description": "A Jamaican seafood dish with crispy fried fish and a spicy pickled sauce.",
        "idmeal": "52944",
        "category": "Seafood",
        "area": "Jamaican",
        "instructions": "Rinse fish and rub with lemon or lime. Fry the fish in hot oil until crispy on both sides. In the same pan, sauté garlic, ginger, onion, bell peppers, thyme, scotch bonnet, sugar, and allspice. Add vinegar and let it simmer. Serve the sauce over the fried fish.",
        "thumbnail": "https://www.themealdb.com/images/media/meals/1520084413.jpg",
        "youtube": "https://www.youtube.com/watch?v=nF6DOtGE6k8",
        "ingredients": [
            "2 Pounds Red Snapper",
            "1/2 cup Vegetable Oil",
            "1 clove peeled crushed Garlic",
            "1/2 tsp Ginger",
            "2 sprigs Thyme",
            "1 Bay Leaf",
            "0.5 Red Pepper",
            "0.5 Yellow Pepper",
            "1 sliced Onion",
            "1 chopped Carrots",
            "1 tbs Sugar",
            "1/2 tsp Allspice",
            "1 tsp Worcestershire Sauce",
            "1 Scotch Bonnet",
            "1 Lime",
            "3/4 cup Malt Vinegar",
            "pinch Pepper"
        ],
        "source": "https://www.themealdb.com/meal/52944",
        "thisweek": false,
        "favorite": false
    },
    {
        "name": "Duck Confit",
        "description": "A classic French dish of tender duck legs slow-cooked in their own fat.",
        "idmeal": "52907",
        "category": "Miscellaneous",
        "area": "French",
        "instructions": "Marinate duck legs overnight with salt, garlic, and herbs. Brush off salt and place in a saucepan with wine. Simmer very slowly for 2 hours until tender. To crisp, roast in the oven at 220C for 30-40 mins until brown and crisp.",
        "thumbnail": "https://www.themealdb.com/images/media/meals/wvpvsu1511786158.jpg",
        "youtube": "https://www.youtube.com/watch?v=MHhLJqghY-o",
        "ingredients": [
            "Handful Sea Salt",
            "4 Bay Leaf",
            "4 cloves Garlic",
            "Handful Thyme",
            "4 Duck Legs",
            "100ml White Wine"
        ],
        "source": "https://www.themealdb.com/meal/52907",
        "thisweek": false,
        "favorite": true
    }
]